if __name__ == "__main__":
    surname_list = [  # список фамилий Санкт-Петербурга
        "Иванов",
        "Васильев",
        "Петров",
        "Смирнов",
        "Михайлов",
        "Фёдоров",
        "Соколов",
        "Яковлев",
        "Попов",
        "Андреев",
        "Алексеев",
        "Александров",
        "Лебедев",
        "Григорьев",
        "Степанов",
        "Семёнов",
        "Павлов",
        "Богданов",
        "Николаев",
        "Дмитриев",
        "Егоров",
        "Волков",
        "Кузнецов",
        "Никитин",
        "Соловьёв"
    ]
    for i, j in enumerate(surname_list, start=1):
        print(i, j)
    # TODO распечатать фамилии и их номера
