# Напишите ваше решение
a = int(input())
b = int(input())
c = int(input())
list_ = [a, b, c]
print(min(list_))