# Напишите ваше решение
s_time = int(input("Среднее время: "))
print("Общее время: ", (s_time * 10) // 60, "часов", (s_time * 10) % 60, "минут")
