# Напишите ваше решение
ST = 13
oklad = int(input())
pn = oklad / 100 * ST
sum_ = oklad - pn
print (pn, sum_)
